import React from "react";
import './Shoppingcontext.css';
const Companycontext=()=>{
    return(
<div>
<h4 className='basefont'><span className='bluecontext'>وب سایت شرکتی:</span>وب سایت شرکتی:نوع دیگری از وب سایت ها سایت های شرکتی هستند که شامل معرفی شرکت یا کسب و کار توضیحات روند بیزینسی و همچنین سفارش انلاین و سایر ویژگی های این چنینی میباشند.وب سایت های شرکتی میتونن با هزینه ی کمتر زمان کمتر و یک هاست معمولی به خوبی کار کنند.اگر محصولات شما به صورت کاتالوگ میباشد و فروش آنلاین ندارید بهترین گزینه برای شما وب سایت شرکتی است.برای اطلاعات بیشتر با ما تماس بگیرید.</h4>
             </div>
    );
};
export default Companycontext;