import React from "react";
import './Reactcontext.css';
export const Reactcontent =()=>{
    return(
<h4 className='basefont'>
ری اکت یک کتابخانه جاوا اسکریپتی برای ساختن یک UIیا رابط کاربری میباشد.
وقتی میگیم جاوااسکریپت یعنی سایت به راحتی روی مرورگر اجرا میشه و ما منتظر نتیجه از سرور نمیمونیم .
<br/>
ری اکت روی 
رابط کاربری  بیشتر تمرکز داره  و برای اینکار از کامپوننت ها 
استفاده میکنه از جمله سایت هایی که از ری اکت استفاده میکنند میتوان به
اسنپ-دیوار-ریحون-سازیتو و ایوند اشاره کرد...  
</h4>
    )
}
const Wordpresscontent=()=>{
    return(
<h4 className='basefont'>
اگر بخواهیم به زبان ساده به معرفی وردپرس بپردازیم،
 وردپرس عبارت است 
 از یک سیستم مدیریت محتوای سایت ساز که با استفاده از آن میتوان تا به راه اندازی انواع گوناگونی
  از وبسایت و وبلاگ بپردازید. 
     به جرأت می توان گفت به دلیل انعطاف بالایی که سیستم وردپرس دارد
      با استفاده از آن قادر خواهید بود تا اقدام به راه اندازی هر نوع وبسایت با وردپرس کنید.
</h4>
    )
}
export default Wordpresscontent;