import React from "react";
import './Reactguidecontext.css';
export const First=()=>{
    return(
<p className="conte">
  <h2 className='head'>
  چرا React متفاوت است؟
  </h2>
  <br/>
  وب سایت ها و استارت آپ هایی چون فیس بوک، اینستاگرام، نتفلیکس، اوبر و… در حال حاضر در حال استفاده از react js هستند. برای مثال فیس بوک از ری اکت برای عناصر کوچک مانند دکمه های لایک و ورود استفاده می کند. همچنین عملکرد اشتراک گذاری، عملکرد نظرات و جاسازی پست و ویدیو نیز توسط React ارائه می شود. سایر ویژگی های مهم ساخته شده با این فناوری عبارتند از عملکرد چت، نمایه کاربر و عملکرد اشتراک.

محبوبیت این نوع طراحی امروزه از همه فریمورک های توسعه فرانت اند دیگر فراتر رفته است. دلایل زیر علت محبوبیت این کتابخانه و اینکه چرا توسط تعداد زیادی از سازمان ها و کسب و کارها پذیرفته شده است را توجیه می کند و باعث شده امروزه شاهد انواع سایت های طراحی شده با react (سایت آموزشی ، فروشگاهی ، شرکتی و …) باشیم.
<br/>
ایجاد آسان برنامه های پویا:
React برخلاف جاوا اسکریپت، جایی که اغلب کدنویسی خیلی سریع پیچیده می شود، ایجاد برنامه های وب پویا را آسان تر می کند؛ زیرا با کدنویسی کمتر، عملکرد بیشتری ارائه می کند.
<br/>
عملکرد بهبود یافته:
این کتابخانه از دام (DOM) مجازی استفاده می کند، در نتیجه برنامه های وب را سریع تر ایجاد می کند.
<br/>
اجزای قابل استفاده مجدد:
مؤلفه ها، بلوک های سازنده هر برنامه React هستند. یک برنامه واحد معمولاً از چندین مؤلفه تشکیل شده است. این مؤلفه ها، منطق و کنترل های خود را دارند و می توان از آن ها در سراسر برنامه استفاده مجدد کرد که به نوبه خود زمان توسعه برنامه را به طور چشمگیری کاهش می دهد.
<br/>
جریان داده های یک طرفه:
این کتابخانه از یک جریان داده یک طرفه پیروی می کند، این بدان معنی است که هنگام طراحی سایت با React، توسعه دهندگان اغلب اجزای فرزند را در اجزای والد قرار می دهند. از آنجایی که داده ها در یک جهت جریان می یابند، اشکال زدایی خطاها و دانستن محل بروز مشکل در یک برنامه کاربردی در لحظه مورد نظر آسان تر می شود.
  </p>
    )
}
const Sec=()=>{
    return(
<p className="conte">
  <h2 className='head'>
  برتری React
  </h2>
  <br/>
  یکی از اصلی‌ترین مزیت‌های فریم ورک react.js نسبت به رقبا این است که در ایران محبوبیت 99 درصدی دار
  د. یعنی کم‌تر کارفرمایی از شما ساختار و قالب طراحی دیگری می‌خواهد. تازه‌سازی سریع و کدگذاری بهینه
   از جمله مزایای کلیدی دیگری است که در این پلتفرم می‌بینیم.
   در نهایت آزادی زیادی در انتخاب توسعه‌دهنده دارید.
   اگر مدیر یک پروژه هستید می‌توانید به‌راحتی توسعه دهندگان زیادی را بیابید
   که بر این مبنا کار می‌کنند و می‌توانند با استفاده از فریم ورک react.js پروژه‌های بی‌نظیری برای شما خلق کنند.
   <br/>
   یکی از مهمترین مزیت های ری اکت طبق تجربه شخصی این است که در ری اکت میتونین هر المنت رو هر جایی با هر فرم و فرمتی قرار بدین
   در واقع میتونین همون چیزی که هدفتون هست رو پیاده سازی بکنین اگر بخواین یه دکمه در حال راه رفتن در شمالی شرقی صفحتون داشته باشید میتونینبه راحتی اونو خلق کنین و بعدم هرجایی از صفحتون ازش استفاده بکنین بدون این
    که نیاز به کد نویسی مجدد باشه و خب این یعنی حجم کم کد و رندر سریع صفحه و در نهایت سرعت و قدرت سایت شما.برای انتخاب بهتر میتونین با مشاورین ما در تماس باشید.
  </p>
    )
}
export default Sec;