import React from "react";
import './Shoppingcontext.css';
const Shoppingcontext=()=>{
    return(
<div>
<h4 className='basefont'><span className='bluecontext'>وب سایت فروشگاهی:</span>از جمله وب سایت های قابل طراحی وب سایت های فروشگاهی هستند که شامل ویژگی های بیشتری نسبت به سایر وب سایت ها میباشند شامل پنل های خرید و صفحات معرفی کالا آمار فروش روزانه و مقدار بازدید از کالا ها و درصد فروش هر کالا و بسیاری ویژگی های دیگر .در کل وب سایت های فروشگاهی پیچیدگی بیشتری دارند و به علت نمایش عکس محصولات نیازمند هاست با حجم بالاتر و هسته قوی تر هستند.برای اطلاعات بیشتر با ما تماس بگیرید.</h4>
</div>
    );
};
export default Shoppingcontext;