import React from "react";
import { useEffect } from 'react';
import Aos from 'aos';
import 'aos/dist/aos.css';
import './Wordpressguidecontext.css';
export const Firstcon=()=>{
    return(
<h4>
اگر در انجمن های گوناگون عضو شده باشید گاها با موضوعاتی مواجه می شوید از قبیل اینکه آیا با وردپرس می توان یک سایت با موضوعات (فروشگاهی، خبری، شرکتی، موزیک و…) راه اندازی کرد؟ عموم کاربران که به تازگی قصد دارند تا وارد دنیای بزرگ وردپرس شوند همواره چنین سوالاتی را از دیگران می پرسند تا بتوانند یک سیستم مدیریت محتوای مناسب برای سایت خود انتخاب کنند.
اگر بخواهیم به زبان ساده به معرفی وردپرس بپردازیم، وردپرس عبارت است از یک سیستم مدیریت محتوای سایت ساز که با استفاده از آن قادر خواهید بود تا به راه اندازی انواع گوناگونی از وبسایت و وبلاگ بپردازید. با اطمینان بر اساس تجربیات شخصی و نمونه های  مشاهده شده به جرأت می توانم این اطمینان را به شما بدهم به دلیل انعطاف بالایی که سیستم مدیریت محتوای وردپرس دارد با استفاده از آن قادر خواهید بود تا اقدام به راه اندازی هر نوع وبسایت با وردپرس کنید.


اگر بخواهیم با یک زبان حرفه ای تر اقدام به معرفی وردپرس کنیم و پاسخ این سوال را که وردپرس چیست؟ را بدهیم می توان گفت، وردپرس عبارت است از یک سایت ساز متن باز و رایگان تحت وب که در دسته CMS ها قرار دارد. همانطور که اشاره شد وردپرس به صورت رایگان و متن باز می باشد که می توان آن را جزء دسته نرم افزارهای دنیای آزاد  قرار داد.  به معنی این است که اگر دستی در برنامه نویسی و کدنویسی داشته باشید قادر خواهید بود تا هر نوع شخصی سازی بر روی وردپرس انجام داده و سایت دلخواه خود را با استفاده از آن  طراحی و پیاده سازی کنید.
</h4>
    )
};
export const Head=()=>{
    useEffect(()=>{
        Aos.init({duration:2000});
    },[]);
    return(
        <div className="colomnheader" data-aos="fade-down">
            <div>
                <h1>چرا وردپرس؟</h1>
            </div>

<div className="one" data-aos="flip-down">
    <h3>*سادگی و راحتی در استفاده</h3>
</div>
<div className="two"data-aos="flip-down">
    <h3>*پایداری و خلاقانه بودن</h3>
</div>
<div className="three" data-aos="flip-down">
    <h3>*طراحی جذاب</h3>
</div>
<div className="four" data-aos="flip-down">
    <h3>*انعطلف پذیر</h3>
</div>

        </div>
    );
};
const Seccon=()=>{
    return(
<div>
<h4>
    طراحی سایت با وردپرس این امکان را به ما میدهد که بتونیم وب سایت انلاین شما در در محیطی امن با تمام ویژگی های مورد نظرتان در کمترین زمان ممکن و مقرون به صرفه تحویل شما بدهیم.
    وردپرس شامل افزونه های متفاوتی هست که هرانچه شما برای سایت خود نیاز دارید را محیا میسازد.همچنین شامل بیش از هزاران قالب اماده و زیبا میباشد که فقط کافیست اطلاعاتتون رو توی قالب جدید اپدیت کنید.
    در وردپرس میتوان سئو سایت میزان بازدید حتی درصد کمیسیون ها و خیلی چیزای دیگه رو کنترل کرد و بهترین پلتفرم برای وب سایت های فروشگاهی هست که امروزه بیشترین وب سایت های فروشگاهی جهان از وردپرس استفاده میکنند.
    وردپرس یه رابط کاربری ساده داره که بعد از انتخاب مدیر سایت میتونه در قسمت داشبود محصولاتی را اضافه یا حذف کند یا حتی مشخص کند هرمحصول پس از ثبت سفارش به کجا پست شوند.
 
    پنل های خرید و صفحات معرفی کالا آمار فروش روزانه و 
     مقدار بازدید از کالا ها و درصد فروش هر کالا و بسیاری ویژگی های دیگر در وردپرس به راحتی قابل دسترس هستند.
</h4>
</div>
    );
}
export default Seccon;